[
  {
    "id": "pratyangira-homa-01",
    "name": "Pratyangira Homa",
    "description": "Goddess Pratyangira Devi is represented as a lion and a human. She emerged from Lord Shiva’s third eye. For someone who wants to be completely free from all types of negative impacts and evil forces and influences in life, Pratyangira Devi homam is highly helpful.",
    "price": 3500,
    "imageUrl": "/assets/pratyangira-devi.jpg",
    "heroUrl": "/assets/homa-fire.jpg",
    "schedule": "Performed on Amavasya day every month.",
    "significance": "Pratyangira Devi is invoked during times of extreme difficulties, especially to overcome obstacles related to negative forces, black magic, and misfortune. She is often worshipped through special pooja rituals to bring peace, protection, and prosperity into the lives of her devotees. The energy of Pratyangira Devi is said to be powerful enough to combat even the most intense spiritual and material challenges.",
    "benefits": [
      {
        "title": "Protection from Negative Energies",
        "text": "Pratyangira Devi is known for her ability to protect her devotees from harmful forces, evil eyes, and black magic."
      },
      {
        "title": "Overcoming Obstacles",
        "text": "Whether facing personal challenges or external threats, worshipping Pratyangira Devi helps in removing barriers and ensuring success."
      },
      {
        "title": "Health and Healing",
        "text": "Her energy is also associated with healing, helping devotees recover from illnesses and offering spiritual cleansing."
      },
      {
        "title": "Prosperity and Abundance",
        "text": "Those seeking to invite wealth and abundance into their lives can perform Pratyangira Devi poojas for material and spiritual prosperity."
      }
    ],
    "howItsPerformed": "A traditional Pratyangira Devi pooja involves chanting powerful mantras, lighting sacred fires (homams), and invoking the divine presence of the goddess. These rituals are performed with utmost devotion and precision to ensure that her blessings of protection, prosperity, and healing are bestowed upon the devotee."
  }
]